ATsupportum/src/Catalogs/Проекты_ат/Проекты_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты_ат</name>
  <comment>!!!!!HOTFIX</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Архивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БудущихПериодов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПроектаДляОтчетов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляОтчетов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаследоватьПараметры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСогласовыватьРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьДляКлиентов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИТС_временное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеМетки</name>
    <attributes>
      <name>Метка</name>
      <type>
        <types>CatalogRef.Метки_ат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбластиЗнаний</name>
    <attributes>
      <name>ОбластьЗнаний</name>
      <type>
        <types>CatalogRef.ОбластиЗнаний_ат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Кураторы</name>
    <attributes>
      <name>Куратор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Продукты</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Продукты_ат</types>
        <types>CatalogRef.ГруппыПродуктов_ат</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ATsupportum/src/InformationRegisters/ИсторияКомментариев_ат/ИсторияКомментариев_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияКомментариев_ат</name>
  <comment>!!!!!HOTFIX</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef.ОплатаПоставщику_ат</types>
      <types>DocumentRef.СчетНаОплату_ат</types>
      <types>CatalogRef.Продукты_ат</types>
      <types>CatalogRef.Договоры_ат</types>
      <types>DocumentRef.Задание_ат</types>
      <types>DocumentRef.Релиз_ат</types>
      <types>DocumentRef.Заявка_ат</types>
      <types>CatalogRef.ПоставкиПродуктов_ат</types>
      <types>CatalogRef.ЭкземплярыПродуктов_ат</types>
      <types>CatalogRef.ВидыФайловогоКаталога_ат</types>
      <types>CatalogRef.РолиСерверов_ат</types>
      <types>CatalogRef.Серверы_ат</types>
      <types>DocumentRef.Согласование_ат</types>
      <types>DocumentRef.ФиксацияРабот_ат</types>
      <types>CatalogRef.Проекты_ат</types>
      <types>CatalogRef.Доступы_ат</types>
      <types>DocumentRef.СписаниеСоСчетаКлиента_ат</types>
      <types>CatalogRef.ВерсииПродуктов_ат</types>
      <types>DocumentRef.ВводТарифов_ат</types>
      <types>CatalogRef.Контрагенты_ат</types>
      <types>DocumentRef.Реализация_ат</types>
      <types>CatalogRef.Метки_ат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ATsupportum/src/Catalogs/Контрагенты_ат/Контрагенты_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты_ат</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ОдинЭс</name>
      <description>1С</description>
    </items>
    <items>
      <name>Microsoft</name>
      <description>Microsoft</description>
    </items>
  </predefined>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВнутреннее</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъединятьНоменклатуру</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноВнешнееСогласованиеРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СокращеннаяТемаУведомлений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомлятьОЗадолженностях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ВнутреннийКомментарийВHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ATsupportum/src/Catalogs/Проекты_ат/Forms/ФормаГрупповогоВыбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДерево();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДерево(Клиенты = Неопределено)
	
	ДеревоЗначений = РеквизитФормыВЗначение("Дерево");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЛОЖЬ КАК Пометка,
		|	Проекты_ат.Ссылка,
		|	Проекты_ат.Наименование,
		|	ВЫРАЗИТЬ(ИсторияКомментариев_атСрезПоследних.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
		|	Проекты_ат.Архивный,
		|	Проекты_ат.БудущихПериодов
		|ИЗ
		|	Справочник.Проекты_ат КАК Проекты_ат
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияКомментариев_ат.СрезПоследних КАК ИсторияКомментариев_атСрезПоследних
		|		ПО ИсторияКомментариев_атСрезПоследних.Ссылка = Проекты_ат.Ссылка
		|ГДЕ
		|	Проекты_ат.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				Проекты_ат.Ссылка
		|			ИЗ
		|				Справочник.Проекты_ат КАК Проекты_ат
		|			ГДЕ
		|				Проекты_ат.Родитель = ЗНАЧЕНИЕ(Справочник.Проекты_ат.ПустаяСсылка)
		|				И ВЫБОР
		|					КОГДА &ОтбиратьПоКлиентам
		|						ТОГДА Проекты_ат.Клиент В (&Клиенты)
		|								ИЛИ Проекты_ат.Клиент = ЗНАЧЕНИЕ(Справочник.Контрагенты_ат.ПустаяСсылка)
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ)
		|"+ ?(Элементы.СкрытьАрхивные.Пометка, "И НЕ Проекты_ат.Архивный", "") +"
		|"+ ?(Элементы.СкрытьБудущие.Пометка, "И НЕ Проекты_ат.БудущихПериодов", "") +"
		|
		|УПОРЯДОЧИТЬ ПО
		|	Проекты_ат.Архивный ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("ОтбиратьПоКлиентам", Элементы.ОтборПоКлиентам.Пометка);
	Запрос.УстановитьПараметр("Клиенты", Клиенты);
	
	ДеревоЗначений = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Для каждого ВыбранныйПроект Из ВыбранныеПроекты Цикл
		
		СтрокаДерева = ДеревоЗначений.Строки.Найти(ВыбранныйПроект.Значение, , Истина);
		
		Если СтрокаДерева <> Неопределено Тогда
			
			СтрокаДерева.Пометка = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоЗначений, "Дерево");
	
КонецПроцедуры 

&НаКлиенте
Процедура СкрытьАрхивные(Команда)

	Элементы.СкрытьАрхивные.Пометка = НЕ Элементы.СкрытьАрхивные.Пометка;
	ЗаполнитьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьБудущие(Команда)
	
	Элементы.СкрытьБудущие.Пометка = НЕ Элементы.СкрытьБудущие.Пометка;
	ЗаполнитьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоКлиентам(Команда)
	
	Кнопка = Элементы.ОтборПоКлиентам;
	
	Если Кнопка.Пометка Тогда
		Кнопка.Пометка = Ложь;
		Кнопка.РасширеннаяПодсказка.Заголовок = "Установить отбор по клиентам";
		ЗаполнитьДерево();
	Иначе	
		СтруктураКлиентов = ОткрытьФормуМодально("Справочник.Контрагенты_ат.Форма.ФормаГрупповогоВыбора");
		Если СтруктураКлиентов <> Неопределено И СтруктураКлиентов.Клиенты.Количество() > 0 Тогда
			Кнопка.Пометка = Истина;
			Кнопка.РасширеннаяПодсказка.Заголовок = СтруктураКлиентов.Представление;
			ЗаполнитьДерево(СтруктураКлиентов.Клиенты);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПометкаПриИзменении(Элемент)
	
	Для Каждого ВыделеннаяСтрока Из ТекущийЭлемент.ВыделенныеСтроки Цикл
        Если ТипЗнч(ВыделеннаяСтрока) = Тип("Число") Тогда
            ДанныеСтроки = Элементы.Дерево.ДанныеСтроки(ВыделеннаяСтрока);
        Иначе
            ДанныеСтроки = ВыделеннаяСтрока;
		КонецЕсли;
		
		Если ДанныеСтроки <> ТекущийЭлемент.ТекущиеДанные Тогда // т.к. для текущий строки пометку меняет сама платформа
			ДанныеСтроки.Пометка = Не ДанныеСтроки.Пометка;
		КонецЕсли;
		
		ОбработатьИзменениеПометки(ДанныеСтроки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеПометки(ЭлементДерева)
	
	ПроектВСписке = ВыбранныеПроекты.НайтиПоЗначению(ЭлементДерева.Ссылка);
	Пометка = ЭлементДерева.Пометка;
	Если Пометка И ПроектВСписке = Неопределено Тогда
		ВыбранныеПроекты.Добавить(ЭлементДерева.Ссылка, ЭлементДерева.Наименование);
	ИначеЕсли НЕ Пометка И ПроектВСписке <> Неопределено Тогда
		ВыбранныеПроекты.Удалить(ПроектВСписке);
	КонецЕсли;
	
	ДочерниеЭлементы = ЭлементДерева.ПолучитьЭлементы();
	
	Для Каждого Элемент Из ДочерниеЭлементы Цикл
		Элемент.Пометка = Пометка;
        ОбработатьИзменениеПометки(Элемент);
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущийЭлемент.ТекущиеДанные.Пометка = НЕ ТекущийЭлемент.ТекущиеДанные.Пометка;
	ОбработатьИзменениеПометки(ТекущийЭлемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	
	//!!ТУДУ - нужно состояние флагов СкрытьАрхивные и СкрытьБудущихПериодов переносить как условие фильтра для списка
	// из основной формы, т.е. если в этой форме стоит галка "СА", ни один проект не выделен, и нажимаем Применить,
	// то в списке заданий/задач надо скрыть все с архивными основными проектами
	Если ВыбранныеПроекты.Количество() > 0 Тогда
		МассивВыбранных = Новый Массив;
		Представление = "Установлен отбор по " + ?(ВыбранныеПроекты.Количество() = 1, "проекту: ", "проектам: ");
		
		Для Каждого ВыбранныйПроект Из ВыбранныеПроекты Цикл
			МассивВыбранных.Добавить(ВыбранныйПроект.Значение);
			Представление = Представление + ВыбранныйПроект.Представление + "; ";
		КонецЦикла;
		Представление = Лев(Представление, СтрДлина(Представление) - 2) + "."; //!!ТУДУ: заменить на Строки_ат.ВернутьОбрезаннуюСКонца(Представление, 2)
		
		Закрыть(Новый Структура("Проекты, Представление", МассивВыбранных, Представление));
	Иначе	
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	
	Элементы.НадписьПроектКомментарий.Заголовок = Элемент.ТекущиеДанные.Комментарий;	
	
	//!ТУДУ -  Программно зафиксировать колонку почему-то не поучается :( А без этого не работают Enter и пробел с клавиатуры
	//			для изменения состояния пометки
	Элементы.Дерево.ТекущийЭлемент = Элементы.ДеревоПометка;
	
КонецПроцедуры
